package com.uin.dp.didi;

/**
 * Bob有一个文本文件。
 * 因为新系统上的文本编辑器太难用了，Bob在其中进行查找和替换时只能纯人工操作。
 * 为了早点下班，Bob决定找你开发一个查找和替换软件来降低他的工作量。
 * 现在他拿来了一些测试样例，你需要尽快写出一个能够通过这些样例的程序来交差。
 */

/**
 * 输入的第一行是一个由小写英文字母组成的字符串s。
 * <p>
 * 第二行有一个正整数n(1<=n<=100)，代表替换操作的次数。
 * <p>
 * 接下来n行每行有两个以空格隔开的由小写英文字母组成的字符串t1和t2，代表你的程序需要将S中每个t1从前到后逐个替换成t2。如s=abababa，t1=aba，t2=cc，则逐个替换的结果为abababa->ccbaba->ccbcc。s中第二个aba在第一次替换中被破坏，因此只有第一个和第三个aba才会被替换成cc。
 * <p>
 * 输入保证s的长度在任意一次替换前后均不会超过2000，且t1与t2的长度之和不超过100。
 */
public class FindAndReplace {
}
